#include <iostream>
#include <conio.h>
#include "ClassCity.h"
using namespace std;

void main() 
{ 
	List t; 
	int n; 
	do{ 
		cout<<"\n***********************主菜单*****************************";
		cout<<"\n\n************** 1.增加城市；            *******************"; 
		cout<<"\n\n************** 2.删除城市；            *******************"; 
		cout<<"\n\n************** 3.查询城市信息；        *******************"; 
		cout<<"\n\n************** 4.修改城市信息；        *******************"; 
		cout<<"\n\n************** 5.查询某坐标附近的城市；*******************";
		cout<<"\n\n************** 6.其他按键退出程序；    *******************";
		cout<<"\n\n**********************************************************"<<endl;
		cout<<"\n请输入你的选择操作:"; 
		cin>>n; 
		switch(n) {		 
			case 1:
				t.Insert();//1.增加城市
				cout<<"\n按任意键返回菜单>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>";
				_getch();
				cout<<"\n";
				break; 
			case 2:
				t.Delete(); //2.删除城市
				cout<<"\n按任意键返回菜单>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>";
				_getch();
				cout<<"\n";
				break; 
			case 3:
				t.Search(); //3.查询城市信息
				cout<<"\n按任意键返回菜单>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>";
				_getch();
				cout<<"\n";
				break; 
			case 4:
				t.Change();//4.修改城市信息
				cout<<"\n按任意键返回菜单>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>";
				_getch();
				cout<<"\n";
				break; 
			case 5:
				t.Nearcity();//5.查询某点附近的城市
				cout<<"\n按任意键返回菜单>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>";
				_getch();
				cout<<"\n";
			    break; 
			default:
				break; //6.其他按键退出程序
	    } 
	}while(n>0&&n<6);  
} 